[
    {
        "title": "Selena Gomez marries music producer Benny Blanco",
        "summary": "US pop star and actress Selena Gomez has married music producer Benny Blanco in a ceremony held in Santa Barbara, California. The couple exchanged vows on Saturday before approximately 170 guests, including celebrities like Taylor Swift, Paul Rudd, Steve Martin, and Martin Short. Gomez shared images on Instagram captioned \"9.27.25,\" and Blanco referred to her as \"My wife in real life.\" The pair, who have a history of musical collaborations and released an album in March, became engaged in December 2024.",
        "url": "https://www.bbc.com/news/articles/cvgq5jzxx77o"
    },
    {
        "title": "Oregon sues Trump administration over plans to deploy troops",
        "summary": "The National Guard will be deployed to Portland, Oregon, for two months by presidential order to protect federal property, specifically ICE facilities, which President Trump described as being under attack from \"Antifa\" and \"domestic terrorists.\" Oregon's Attorney General has sued the Trump administration, arguing the deployment is \"unlawful,\" \"provocative,\" and threatens public safety. Democratic lawmakers and the governor have rejected the need for federal intervention, while some Republican officials support the move due to perceived \"lawlessness.\" This deployment follows similar federal interventions in other US cities, raising legal questions about the use of military force for domestic matters.",
        "url": "https://www.bbc.com/news/articles/cddmn6ge6e2o"
    },
    {
        "title": "At least four dead and several injured in shooting at Mormon church in Michigan",
        "summary": "At least four people were killed and several others injured after a gunman drove a vehicle into a Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, opened fire, and set the building ablaze during a Sunday service. The suspect, Thomas Jacob Sanford, 40, was shot dead by police at the scene. Authorities are investigating the incident as an \"act of targeted violence,\" though the motive remains unclear, with the FBI leading the inquiry. The attack caused extensive damage, and investigators are examining the suspect's background to establish a motive.",
        "url": "https://www.bbc.com/news/articles/ceq2vd15glwo"
    },
    {
        "title": "Three dead and several injured after shooting at US waterfront bar",
        "summary": "Three people died and several others were injured after a shooter opened fire from a boat at a crowded waterfront bar in Southport, North Carolina, on Saturday evening. The assailant, who fled by boat, was arrested by the US Coast Guard approximately half an hour later in nearby Oak Island. Officials have not yet released the suspect's identity or the names of the deceased, but confirmed about six people were injured. While local police described the incident as tragic for the small community, they stated there are no additional threats.",
        "url": "https://www.bbc.com/news/articles/cq65qj67lpyo"
    },
    {
        "title": "US citizen released by Taliban after nine-month detention",
        "summary": "A US citizen, Amir Amiry, has been released after nine months of detention by the Taliban in Afghanistan, following negotiations led by Qatari mediators. US Secretary of State Marco Rubio confirmed Amiry's release, describing him as \"wrongfully detained\" and thanking Qatar for its \"tireless diplomatic efforts.\" Amiry is the fifth American freed from Afghanistan this year, with the US stating that more citizens remain \"unjustly detained\" in the country.",
        "url": "https://www.bbc.com/news/articles/cvgv1y989xjo"
    }
]