[
    {
        "title": "US Transportation Secretary threatens to fire absent air traffic controllers",
        "summary": "US Transportation Secretary Sean Duffy threatened to fire air traffic controllers calling in sick during the government shutdown, attributing over half of flight delays to their absenteeism. He affirmed that essential workers not reporting for duty would not be paid. The shutdown's impacts are expanding, with the Smithsonian Institution preparing to close and military members potentially missing paychecks. Lawmakers remain deadlocked, as Democrats seek healthcare provisions and Republicans push for a \"clean\" budget bill. Airports are experiencing significant flight disruptions due to rising absenteeism, though a union president denies coordinated sickouts. Homeland Security Secretary Kristi Noem also released a video blaming Democrats for the shutdown, playing in major airports.",
        "url": "https://www.bbc.com/news/articles/cx25833wxy9o"
    },
    {
        "title": "New York Attorney General Letitia James criminally indicted",
        "summary": "New York Attorney General Letitia James has been criminally indicted on federal charges of bank fraud and making false statements to a financial institution. Prosecutors allege James misrepresented a mortgage loan for a Virginia home, claiming it as a secondary residence while using it as a rental investment property to obtain favorable terms. James, who led a civil fraud investigation against former President Trump, has accused him of \"weaponization of our justice system\" and political retribution.\n\nConversely, US prosecutor Lindsey Halligan, appointed by Trump after another prosecutor reportedly found insufficient evidence, stated that \"no one is above the law\" and the charges represent \"intentional, criminal acts.\" If convicted, James could face substantial prison time and fines. The indictment has drawn criticism from figures like New York Governor Kathy Hochul, who view it as a politically motivated abuse of power.",
        "url": "https://www.bbc.com/news/articles/c4g9n4xj904o"
    },
    {
        "title": "What we know about the Gaza ceasefire deal",
        "summary": "US President Donald Trump announced that Israel and Hamas have agreed to the \"first phase\" of a 20-point peace plan following intense indirect negotiations in Egypt. This initial phase includes the release of all hostages by Hamas, an Israeli troop withdrawal to an agreed line (leaving Israel in control of approximately 53% of Gaza), and an immediate ceasefire. Following a 72-hour countdown, remaining live hostages are to be released, after which Israel will release Palestinian prisoners and detainees. Humanitarian aid deliveries into Gaza are also set to increase significantly, monitored by a multinational force. While the first phase is approved, later stages outlining Gaza's demilitarization, governance without Hamas, and further Israeli withdrawal face ongoing disagreements between the parties.",
        "url": "https://www.bbc.com/news/articles/cvgqx7ygq41o"
    },
    {
        "title": "How Trump secured a Gaza breakthrough which eluded Biden",
        "summary": "An Israeli airstrike against Hamas negotiators in Qatar, initially viewed as an escalation, ultimately proved to be a turning point for a hostage deal. President Donald Trump announced an agreement for Hamas to release all remaining hostages, a goal pursued by multiple administrations. Trump's unique diplomatic style, strong relationships with both Israel and Arab nations, and willingness to exert unprecedented pressure on Israeli Prime Minister Netanyahu were key factors. The deal stipulates Hamas releasing hostages in exchange for Israel freeing Palestinian prisoners and a partial withdrawal from Gaza, though long-term peace details like Gaza's governance remain open. This unconventional approach, also influenced by growing international pressure on Israel, led to a conventional peace plan backed by key Muslim nations.",
        "url": "https://www.bbc.com/news/articles/cj3yke64vp6o"
    },
    {
        "title": "Jeremy Bowen: There's now a realistic chance of ending the war - but it's not over yet",
        "summary": "Former President Donald Trump announced a significant breakthrough in Middle East peace efforts, resulting in an initial agreement between Israel and Hamas. The deal, brokered through indirect talks in Egypt, includes a ceasefire, the release of remaining Israeli hostages in exchange for Palestinian prisoners, an IDF pullback from parts of Gaza, and increased humanitarian aid deliveries. While a major step, this framework does not end the war, with substantial disagreements persisting on issues like Israel's long-term presence in Gaza and Hamas's demilitarization.\n\nTrump reportedly used U.S. leverage over Israel, including displeasure over a recent strike in Doha, to bring Prime Minister Benjamin Netanyahu to the negotiating table, succeeding where prior efforts had stalled. Despite complex negotiations ahead and deeply entrenched positions, the agreement offers a realistic chance to alleviate some of the conflict's suffering, prompting celebrations in both Israel and Gaza.",
        "url": "https://www.bbc.com/news/articles/cn5q04yr345o"
    }
]