[
    {
        "title": "Hamas mobilises fighters in Gaza as fears of internal violence mount",
        "summary": "Hamas has recalled approximately 7,000 security forces members and appointed five new governors with military backgrounds to reassert control in areas of Gaza recently vacated by Israeli troops. This mobilization, reportedly aimed at \"cleansing Gaza of outlaws and collaborators,\" follows anticipated moves amid uncertainty about the territory's future governance.\n\nThe reassertion of control comes amid rising tensions, particularly after two Hamas elite forces members were killed by gunmen from the Dughmush clan, leading Hamas to kill one clan member and kidnap 30 others. This development complicates the US President's peace plan, which calls for Hamas to disarm, a notion Hamas officials have publicly rejected. Experts express concern that Gaza is sliding towards internal bloodshed, citing widespread availability of looted weapons and Hamas's attempts to maintain armed control. They warn these actions could jeopardize any peace agreement and intensify suffering for the already exhausted Gazan population.",
        "url": "https://www.bbc.com/news/articles/ce8482418plo"
    },
    {
        "title": "Israelis praise Trump at huge rally ahead of expected hostage release by Hamas in Gaza",
        "summary": "Hundreds of thousands rallied in Tel Aviv ahead of the expected release of Israeli hostages by Hamas, with a top Hamas official confirming the prisoner exchange is set to begin Monday morning as part of a ceasefire agreement. Simultaneously, Egypt is hosting a summit on Monday with over 20 international leaders, including former US President Trump, to finalize an agreement aimed at ending the war. In Gaza, an estimated 500,000 Palestinians have returned to northern areas, largely in ruins, following Israeli troop withdrawal, amidst reports of Hamas reasserting control. Concerns persist over humanitarian aid delivery to Gaza, as the World Food Programme reports limited access despite calls for increased aid, while a UN-backed report estimates 500,000 people are suffering from famine.",
        "url": "https://www.bbc.com/news/articles/c75q5qng0rgo"
    },
    {
        "title": "We're grateful for what Trump is doing for peace, Nobel winner tells BBC",
        "summary": "Venezuelan opposition leader María Corina Machado has been awarded the 2025 Nobel Peace Prize for her campaign against President Nicolás Maduro's rule and her efforts towards a democratic transition. Machado expressed gratitude to US President Donald Trump during a congratulatory call, citing his global actions for peace, freedom, and democracy. The Nobel Committee recognized her for \"civilian courage\" and her \"struggle to achieve a just and peaceful transition from dictatorship to democracy\" despite serious threats. Machado, who was barred from last year's elections, views the award as an \"injection\" for her political movement and advocates for the international community to cut off the Maduro regime's illicit financial flows. The article also notes recent US strikes on boats off Venezuela suspected of drug trafficking, which have drawn international condemnation.",
        "url": "https://www.bbc.com/news/articles/c5y8y25l250o"
    },
    {
        "title": "Trump directs Pentagon to 'use all available funds' to pay troops during shutdown",
        "summary": "President Trump has directed Defense Secretary Pete Hegseth to ensure military personnel receive their scheduled pay despite the ongoing federal government shutdown, aiming to prevent troops from missing their paycheque on October 15. This instruction comes amidst a partisan impasse over a spending plan, which has already led to pay withholding for some federal employees and unprecedented layoffs across several government agencies. The Trump administration has initiated \"reductions in force,\" firing thousands of federal workers, including staff at the CDC, Treasury, and Homeland Security, with the White House indicating further cuts are planned. Major federal employee unions, including the American Federation of Government Employees, have filed a lawsuit to block these layoffs, calling the administration's actions illegal. Republicans and Democrats continue to blame each other for the shutdown, which has idled hundreds of thousands of federal employees and is now being used by the administration to pursue its goal of a smaller federal workforce.",
        "url": "https://www.bbc.com/news/articles/ce808gvp56mo"
    },
    {
        "title": "Academy award-winning actress Diane Keaton dies aged 79",
        "summary": "Oscar-winning actress Diane Keaton has died at the age of 79 in California. She rose to fame in the 1970s with her role as Kay Adams-Corleone in \"The Godfather\" films. Keaton won an Academy Award for Best Actress in 1978 for her performance in \"Annie Hall,\" and also starred in films like \"Father of the Bride\" and \"First Wives Club\" during her five-decade career. Her death on Saturday was confirmed by producer Dori Rath and a family spokesperson. Beyond acting, Keaton also directed several films and was known for her unique style, leaving behind a legacy as a beloved icon.",
        "url": "https://www.bbc.com/news/articles/cr5q5rp4r64o"
    }
]